In [1]:
import pandas as pd
import numpy as np

In [3]:
date = pd.read_csv("orders (1).csv")
time = pd.read_csv("messages.csv")

In [4]:
date.head(5)

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [6]:
time.head(6)

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
5  2016-03-08 22:52:00  пар.32прок.дев.на авто по ночн.городу.Днепр.06...

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [8]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# working with Dates

In [9]:
date['date'] = pd.to_datetime(date['date'])

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [11]:
# extract year 

date['date_year'] = date['date'].dt.year

In [12]:
date.sample(5)

          date  product_id  city_id  orders  date_year
320 2019-04-28        5631       24       1       2019
410 2019-05-17        6309       29       2       2019
263 2019-11-03        6694       25       2       2019
626 2019-12-07        6668       28       1       2019
922 2019-03-28        1658       16      27       2019

In [13]:
#extract month 

date['date_month_no'] = date['date'].dt.month

In [14]:
date['date_month_name'] = date['date'].dt.month_name()

In [15]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [16]:
# extrcat days 

date['date_Days'] = date['date'].dt.day

In [17]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_Days
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [18]:
# day of the week 

date['date_dow'] = date['date'].dt.dayofweek

In [19]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_Days,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [20]:
#day of week - name 

date['date_dow_name'] = date['date'].dt.day_name()

In [21]:
date.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [29]:
# is weekend ? 

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday' , 'Saturday']) , 1 , 0)
date.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [27]:
# extract week of the year 

date['date_week'] = date['date'].dt.isocalendar().week

In [28]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1

In [30]:
date.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [31]:
# extract quarter 

date['quarter'] = date['date'].dt.quarter

In [32]:
date.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

In [33]:
# extract semester 

date['semester'] = np.where(date['quarter'].isin([1 , 2]) , 1 ,2)

In [34]:
date.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month_no,date_month_name,date_Days,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

In [35]:
# extract  time elapsed between dates 

import datetime 
today = datetime.datetime.today()
today

datetime.datetime(2025, 7, 12, 14, 34, 20, 501773)

In [ ]:
today - date['date']

0     2041 days 14:34:20.501773
1     2523 days 14:34:20.501773
2     2454 days 14:34:20.501773
3     2156 days 14:34:20.501773
4     2379 days 14:34:20.501773
                 ...
995   2469 days 14:34:20.501773
996   2410 days 14:34:20.501773
997   2258 days 14:34:20.501773
998   2323 days 14:34:20.501773
999   2097 days 14:34:20.501773
Name: date, Length: 1000, dtype: timedelta64[ns]

In [37]:
(today - date['date']).dt.days

0      2041
1      2523
2      2454
3      2156
4      2379
       ...
995    2469
996    2410
997    2258
998    2323
999    2097
Name: date, Length: 1000, dtype: int64

In [38]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

ValueError: Unit M is not supported. Only unambiguous timedelta values durations are supported. Allowed units are 'W', 'D', 'h', 'm', 's', 'ms', 'us', 'ns'

In [39]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [40]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])

In [41]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [42]:
time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [43]:
# Extract Time part
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [44]:
# Time difference
today - time['date']

0     4227 days 13:44:20.501773
1     4091 days 14:54:20.501773
2     4577 days 14:13:20.501773
3     3879 days 14:03:20.501773
4     4276 days 15:23:20.501773
                 ...
995   4866 days 13:44:20.501773
996   4187 days 15:20:20.501773
997   4652 days 14:57:20.501773
998   4768 days 15:00:20.501773
999   4040 days 15:09:20.501773
Name: date, Length: 1000, dtype: timedelta64[ns]

In [45]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      3.652623e+08
1      3.535161e+08
2      3.955040e+08
3      3.351962e+08
4      3.695018e+08
           ...
995    4.204719e+08
996    3.618120e+08
997    4.019866e+08
998    4.120092e+08
999    3.491106e+08
Name: date, Length: 1000, dtype: float64

In [46]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      6.087704e+06
1      5.891934e+06
2      6.591733e+06
3      5.586603e+06
4      6.158363e+06
           ...
995    7.007864e+06
996    6.030200e+06
997    6.699777e+06
998    6.866820e+06
999    5.818509e+06
Name: date, Length: 1000, dtype: float64

In [47]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      101461.739028
1       98198.905695
2      109862.222362
3       93110.055695
4      102639.389028
           ...
995    116797.739028
996    100503.339028
997    111662.955695
998    114447.005695
999     96975.155695
Name: date, Length: 1000, dtype: float64